<div class="content">
<h1>djb</h1>
<div>October 26, 2009</div>
<a href="http://www.aaronsw.com/weblog/djb.ja">Original link</a><hr>

<p style="text-align: right"><a href="http://www.aaronsw.com/weblog/djb.en">English</a></p>

<p><em>translated by <a href="http://deadbeaf.org/">Motohiro Takayama (mootoh)</a></em></p>

<p>&#12415;&#12435;&#12394;&#12381;&#12429;&#12381;&#12429; D.J. Bernstein &#12364;&#19990;&#30028;&#21490;&#19978;&#26368;&#39640;&#12398;&#12503;&#12525;&#12464;&#12521;&#12510;&#12384;&#12392;&#12356;&#12358;&#12398;&#12434;&#24605;&#12356;&#20986;&#12377;&#12409;&#12365;&#12384;&#12392;&#24605;&#12358;&#12435;&#12384;&#12290;</p>

<p>&#12414;&#12378;&#12289;&#23458;&#35251;&#30340;&#12394;&#20107;&#23455;&#12384;&#12369;&#12434;&#35211;&#12390;&#12415;&#12424;&#12358;&#12290;
djb &#12399;2&#12388;&#12398;&#37325;&#35201;&#12394;&#12471;&#12473;&#12486;&#12512;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#26360;&#12356;&#12383;&#12290;
&#12513;&#12540;&#12523;&#12469;&#12540;&#12496;&#12392; DNS &#12469;&#12540;&#12496;&#12384;&#12290;
&#12393;&#12385;&#12425;&#12418;&#20309;&#30334;&#19975;&#12392;&#12356;&#12358;&#12489;&#12513;&#12452;&#12531;&#12391;&#20351;&#12431;&#12428;&#12390;&#12356;&#12427;&#12290;
&#12354;&#12426;&#12392;&#12354;&#12425;&#12422;&#12427;&#35079;&#38609;&#12394;&#20181;&#20107;&#12434;&#12371;&#12394;&#12375;&#12289;&#12392;&#12390;&#12388;&#12418;&#12394;&#12356;&#39640;&#36000;&#33655;&#12391;&#12418;&#21839;&#38988;&#12394;&#12356;&#12375;&#12289;&#12393;&#12435;&#12394;&#30064;&#24120;&#20107;&#24907;&#12395;&#12418;&#23550;&#24540;&#12377;&#12427;&#12290;
&#12371;&#12428;&#12425;&#12399;&#12289;Bernstein &#12364;&#26368;&#21021;&#12395;&#12522;&#12522;&#12540;&#12473;&#12375;&#12383;&#12392;&#12365;&#12392;&#12414;&#12387;&#12383;&#12367;&#21516;&#12376;&#12418;&#12398;&#12364;&#21205;&#12356;&#12390;&#12427;&#12398;&#12384;&#12290;
&#12402;&#12392;&#12388;&#12398;&#12496;&#12464; (&#12383;&#12387;&#12383;&#12402;&#12392;&#12388;!) &#12364; qmail &#12395;&#35211;&#12388;&#12363;&#12387;&#12383;&#12290;
2&#12388;&#12417;&#12398;&#12496;&#12464;&#12399;&#12289;&#12373;&#12356;&#12365;&#12435; djbdns &#12395;&#22577;&#21578;&#12373;&#12428;&#12383;&#12290;
&#12369;&#12428;&#12393;&#22823;&#20107;&#12394;&#12371;&#12392;&#12399;&#12289;&#20154;&#12293;&#12364;&#12371;&#12398;&#12496;&#12464;&#12434;&#35211;&#12388;&#12369;&#12427;&#12398;&#12395;&#12289;10&#24180;&#36817;&#12367;&#12363;&#12363;&#12387;&#12383;&#12392;&#12356;&#12358;&#20107;&#23455;&#12384;&#12290;</p>

<p>&#12371;&#12435;&#12394;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12503;&#12525;&#12464;&#12521;&#12510;&#12399;&#20182;&#12395;&#12356;&#12420;&#12375;&#12394;&#12356;&#12290;
Donald Knuth &#12399;&#12356;&#12356;&#32218;&#12356;&#12387;&#12390;&#12427;&#12369;&#12428;&#12393;&#12289; TeX &#12395;&#12388;&#12356;&#12390;&#24444;&#12364;&#26360;&#12356;&#12383;&#26085;&#35352; (<a href="http://books.theinfo.org/go/0937073806">&#25991;&#33464;&#30340;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;</a>) &#12434;&#35501;&#12417;&#12400;&#12289;
&#24444;&#12364;&#20309;&#24180;&#12418;&#12496;&#12464;&#12434;&#25506;&#12375;&#32154;&#12369;&#12390;&#12362;&#12426;&#12289;&#12381;&#12398;&#26053;&#12395;&#32066;&#12431;&#12426;&#12364;&#26469;&#12427;&#12371;&#12392;&#12364;&#12394;&#12356;&#12392;&#32771;&#12360;&#12390;&#12356;&#12427;&#12398;&#12364;&#20998;&#12363;&#12427;&#12384;&#12429;&#12358;&#12290;
&#12383;&#12384;&#12289;&#32066;&#12431;&#12426;&#12395;&#28472;&#36817;&#12377;&#12427;&#12424;&#12358;&#12289;&#27497;&#12415;&#12434;&#32368;&#12426;&#36820;&#12377;&#12371;&#12392;&#12375;&#12363;&#12391;&#12365;&#12394;&#12356;&#12398;&#12384; (&#12371;&#12428;&#12364;&#12354;&#12398;&#22855;&#22937;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#35215;&#21063;&#12398;&#25152;&#20197;)&#12290;
djb &#12398;&#35352;&#37682;&#12434;&#22615;&#12426;&#26367;&#12360;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12400;&#12363;&#12426;&#12363;&#12289;&#35504;&#12418;&#12381;&#12398;&#22495;&#12395;&#36817;&#12389;&#12367;&#12371;&#12392;&#12377;&#12425;&#12391;&#12365;&#12390;&#12356;&#12394;&#12356;&#12398;&#12384;&#12290;</p>

<p>&#12375;&#12363;&#12375;&#12424;&#12426;&#37325;&#35201;&#12394;&#35201;&#22240;&#12399;&#12289;&#20027;&#35251;&#30340;&#12394;&#12418;&#12398;&#12384;&#12290;
djb &#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#32654;&#34899;&#21697;&#12394;&#12435;&#12384;&#12290;
&#24863;&#24615;&#12391;&#29702;&#35299;&#12377;&#12427;&#12409;&#12365;&#12289;&#20553;&#22823;&#12394;&#20316;&#21697;&#12384;&#12290;
djb &#12398;&#12467;&#12540;&#12489;&#12399;&#12289;&#12450;&#12454;&#12488;&#12521;&#12452;&#12531;&#12398;&#35211;&#12383;&#30446;&#12364;&#12289;&#12377;&#12368;&#12428;&#12383;&#33464;&#34899;&#12398;&#12424;&#12358;&#12395;&#24515;&#22320;&#12424;&#12356;&#12290;
&#12496;&#12521;&#12531;&#12473;&#12392;&#12522;&#12474;&#12512;&#12364;&#12354;&#12426;&#12289;&#26368;&#19978;&#12398;&#12479;&#12452;&#12509;&#12464;&#12521;&#12501;&#12451;&#12395;&#21213;&#12427;&#12392;&#12418;&#21155;&#12425;&#12394;&#12356;&#12290;
&#20553;&#22823;&#12394;&#35433;&#12364;&#12381;&#12358;&#12391;&#12354;&#12427;&#12424;&#12358;&#12395;&#12289;&#12402;&#12392;&#12388;&#12402;&#12392;&#12388;&#12398;&#25991;&#23383;&#12395;&#24847;&#21619;&#12364;&#12354;&#12427;&#12290;
&#12381;&#12428;&#12382;&#12428;&#12398;&#25991;&#23383;&#12399;&#12289;&#12381;&#12428;&#12364;&#24517;&#35201;&#12384;&#12363;&#12425;&#12381;&#12371;&#12395;&#12354;&#12427;&#12435;&#12384;&#12290;
&#12369;&#12428;&#12393;&#12418;&#12289;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#35501;&#12414;&#12428;&#12427;&#12383;&#12417;&#12395;&#12384;&#12369;&#12354;&#12427;&#12431;&#12369;&#12376;&#12419;&#12394;&#12356;&#12290;
&#20778;&#32654;&#12394;&#12480;&#12531;&#12469;&#12540;&#12398;&#12424;&#12358;&#12395;&#12289;&#33310;&#12358;&#12398;&#12384;!
&#12381;&#12428;&#12418;&#12289;&#12383;&#12384;&#19968;&#20154;&#12398;&#12480;&#12531;&#12469;&#12540;&#12392;&#12375;&#12390;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#12496;&#12524;&#12456;&#12398;&#32068;&#26354;&#12398;&#12424;&#12358;&#12395;&#12289;&#20998;&#21106;&#12375;&#12383;&#12426;&#12289;&#31227;&#21205;&#12373;&#12379;&#12383;&#12426;&#12289;&#20803;&#36890;&#12426;&#12395;&#25147;&#12375;&#12383;&#12426;&#12289;&#12392;&#12356;&#12387;&#12383;&#20966;&#29702;&#12434;&#12417;&#12374;&#12414;&#12375;&#12356;&#36895;&#12373;&#12391;&#12289;&#20309;&#24230;&#12418;&#20309;&#24230;&#12418;&#12371;&#12394;&#12377;&#12290;</p>

<p>&#12384;&#12369;&#12393;&#12289;&#12480;&#12531;&#12473;&#12392;&#36949;&#12387;&#12390;&#12371;&#12358;&#12375;&#12383;&#21205;&#20316;&#12395;&#12399;&#30446;&#30340;&#12364;&#12354;&#12427;&#12290;
&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#12420;&#12427;&#12409;&#12365;&#12371;&#12392;&#12434;&#25104;&#12377;&#12290;
&#12388;&#12414;&#12426;&#12289; web &#12469;&#12452;&#12488;&#12434;&#12415;&#12388;&#12369;&#12289;&#12513;&#12540;&#12523;&#12434;&#12354;&#12387;&#12385;&#12363;&#12425;&#12371;&#12387;&#12385;&#12408;&#12392;&#36939;&#12406;&#12290;
&#26368;&#39640;&#12395;&#12377;&#12372;&#12356;&#12471;&#12490;&#12522;&#12458;&#12384;&#12392;&#12289;&#12513;&#12540;&#12523;&#12398;&#37197;&#36865;&#12392;&#21306;&#20998;&#12369;&#12399;&#12289;&#24040;&#22823;&#12391;&#32066;&#12431;&#12426;&#12398;&#12394;&#12356;&#12496;&#12524;&#12456;&#12398;&#32068;&#26354;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12384; &#12290;
(&#12502;&#12521;&#12472;&#12523;&#12398;&#12471;&#12483;&#12488;&#12467;&#12512;&#12289; &ldquo;The Office&rdquo; &#12434;&#24605;&#12356;&#28014;&#12363;&#12409;&#12390;&#12415;&#12424;&#12358;)&#12290;
&#12391;&#12418;&#12371;&#12428;&#12399;&#19968;&#26178;&#12398;&#24187;&#24819;&#12394;&#12435;&#12363;&#12376;&#12419;&#12394;&#12356;&#12290;
&#12354;&#12394;&#12383;&#12398;&#12513;&#12540;&#12523;&#12399;&#12289;&#27598;&#26085;&#12371;&#12435;&#12394;&#12405;&#12358;&#12395;&#12375;&#12390;&#20966;&#29702;&#12373;&#12428;&#12390;&#12356;&#12427;&#12435;&#12384;&#12290;</p>

<p>&#12381;&#12428;&#12395;&#12289;&#12371;&#12398;&#12480;&#12531;&#12473;&#12399;&#37969;&#36062;&#12373;&#12428;&#12427;&#12384;&#12369;&#12364;&#30446;&#30340;&#12376;&#12419;&#12394;&#12356;&#12290;
&#30446;&#30340;&#12434;&#25345;&#12387;&#12383;&#12480;&#12531;&#12473;&#12394;&#12435;&#12384;&#12290;
&#20869;&#37096;&#12398;&#27083;&#36896;&#12399;&#12289;&#21487;&#21205;&#37096;&#20998;&#12364;&#26368;&#23567;&#12395;&#12394;&#12427;&#12424;&#12358;&#23436;&#29863;&#12395;&#20316;&#12426;&#19978;&#12370;&#12425;&#12428;&#12390;&#12356;&#12427;&#12290;
&#12420;&#12427;&#12409;&#12365;&#12479;&#12473;&#12463;&#12434;&#12289;&#26368;&#23567;&#38480;&#12398;&#21172;&#21147;&#12391;&#12371;&#12394;&#12379;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12435;&#12384;&#12290;
&#20966;&#29702;&#20869;&#23481;&#12398;&#20998;&#12369;&#26041;&#12289;&#21106;&#12426;&#25391;&#12426;&#26041;&#12395;&#12362;&#12356;&#12390;&#12399;&#35211;&#20107;&#12392;&#12356;&#12358;&#20182;&#12394;&#12356;&#12290;
&#12371;&#12371;&#12391;&#35211;&#20107;&#12384;&#12392;&#35328;&#12387;&#12390;&#12356;&#12427;&#12398;&#12399;&#12289;&#12383;&#12435;&#12395;&#35328;&#35486;&#30340;&#12394;&#24847;&#21619;&#12391;&#12384;&#12369;&#12376;&#12419;&#12394;&#12356;&#12290;
&#12418;&#12385;&#12429;&#12435;&#12381;&#12428;&#12418;&#12354;&#12427;&#12369;&#12393;&#12397;&#12290;
&#12456;&#12524;&#12460;&#12531;&#12488;&#12394;&#25968;&#23398;&#12395;&#35023;&#25171;&#12385;&#12373;&#12428;&#12390;&#12356;&#12427;&#21177;&#29575;&#12398;&#33391;&#12373;&#12364;&#12354;&#12427;&#12363;&#12425;&#12394;&#12435;&#12384;&#12290;
&#12383;&#12367;&#12373;&#12435;&#12398;&#25968;&#24335;&#12395;&#12424;&#12387;&#12390;&#12289;&#12371;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#21205;&#20316;&#12364;&#29702;&#35542;&#30340;&#12395;&#23436;&#29863;&#12391;&#12354;&#12426;&#12289;&#12371;&#12428;&#20197;&#19978;&#12358;&#12414;&#12356;&#12420;&#12426;&#26041;&#12399;&#23384;&#22312;&#12375;&#12394;&#12356;&#12371;&#12392;&#12364;&#20445;&#35388;&#12373;&#12428;&#12390;&#12356;&#12427;&#12290;</p>

<p>&#12371;&#12428;&#12384;&#12369;&#26360;&#12356;&#12390;&#12418;&#12414;&#12384;&#12289; djb &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#36884;&#26041;&#12418;&#12394;&#12356;&#32654;&#12375;&#12373;&#12434;&#35500;&#26126;&#12375;&#12365;&#12428;&#12390;&#12394;&#12356;&#12290;
djb &#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#12377;&#12372;&#12356;&#33109;&#21069;&#12434;&#25345;&#12387;&#12383;&#26368;&#24375;&#12481;&#12540;&#12512;&#12364;&#36062;&#36059;&#12377;&#12427;&#12424;&#12358;&#12394;&#27231;&#26800;&#12391;&#12354;&#12427;&#12384;&#12369;&#12376;&#12419;&#12394;&#12356;&#12290;
&#20154;&#12395;&#20351;&#12431;&#12428;&#12427;&#12371;&#12392;&#12434;&#24847;&#22259;&#12375;&#12383;&#12289;&#12424;&#12367;&#25163;&#12395;&#12394;&#12376;&#12416;&#23567;&#36947;&#20855;&#12391;&#12418;&#12354;&#12427;&#12435;&#12384;&#12290;
&#20778;&#12428;&#12383;&#24037;&#26989;&#12487;&#12470;&#12452;&#12531;&#12395;&#35211;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12289;djb &#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12399;&#20351;&#12358;&#12383;&#12403;&#12395;&#21916;&#12403;&#12364;&#12354;&#12427;&#12290;</p>

<p>&#35328;&#35486;&#12289;&#25968;&#23398;&#12289;&#33464;&#34899;&#12289;&#12487;&#12470;&#12452;&#12531;&#12289;&#27231;&#33021;&#12398;&#32654;&#12434;&#20860;&#12397;&#20633;&#12360;&#12383;&#20998;&#37326;&#12364;&#12289;&#20182;&#12395;&#12354;&#12427;&#12384;&#12429;&#12358;&#12363;? &#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12399;&#12289;&#26126;&#12425;&#12363;&#12395;&#22266;&#26377;&#12398;&#38936;&#22495;&#12395;&#23646;&#12375;&#12390;&#12356;&#12427;&#12290;
&#12394;&#12425;&#12400;&#12289; djb &#12434;&#25171;&#12385;&#36000;&#12363;&#12377;&#12371;&#12392;&#12398;&#12391;&#12365;&#12427;&#12398;&#12399;&#35504;&#12363;? &#12371;&#12371;&#12414;&#12391;&#12398;&#21487;&#33021;&#24615;&#12434;&#20999;&#12426;&#38283;&#12356;&#12390;&#12365;&#12383;&#32773;&#12364;&#20182;&#12395;&#12356;&#12427;&#12384;&#12429;&#12358;&#12363;? &#12381;&#12435;&#12394;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12387;&#12390;&#30693;&#12387;&#12390;&#12427;&#20154;&#12364;&#12356;&#12383;&#12384;&#12429;&#12358;&#12363;?</p>

<p>&#22855;&#22937;&#12394;&#12371;&#12392;&#12384;&#12369;&#12428;&#12393;&#12289; djb &#12395;&#12388;&#12356;&#12390;&#12398;&#23244;&#24746;&#12434;&#38706;&#12431;&#12395;&#12375;&#12390;&#12356;&#12427;&#20154;&#12383;&#12385;&#12364;&#12383;&#12367;&#12373;&#12435;&#12356;&#12427;&#12290;
&#29702;&#30001;&#12398;1&#12388;&#12399;&#12289;&#22825;&#25165;&#12395;&#23550;&#12377;&#12427;&#19968;&#33324;&#30340;&#12394;&#23244;&#24746;&#24863;&#12395;&#12424;&#12427;&#12418;&#12398;&#12384;&#12290;
djb &#12364;&#21147;&#24375;&#12367;&#12289;&#22949;&#21332;&#12398;&#12394;&#12356;&#12499;&#12472;&#12519;&#12531;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12398;&#12399;&#26126;&#12425;&#12363;&#12391;&#12289;&#12381;&#12428;&#12364;&#20658;&#24930;&#12373;&#12392;&#12363;&#28961;&#31036;&#12384;&#12392;&#12363;&#12356;&#12358;&#35492;&#35299;&#12395;&#12424;&#12367;&#12388;&#12394;&#12364;&#12427;&#12290;
&#20182;&#12398;&#29702;&#30001;&#12392;&#12375;&#12390;&#12399;&#12289;&#23455;&#21033;&#20027;&#32681;&#12395;&#12424;&#12427;&#12377;&#12368;&#12428;&#12383;&#12487;&#12470;&#12452;&#12531;&#12408;&#12398;&#36605;&#35222;&#12395;&#12424;&#12427;&#12418;&#12398;&#12364;&#12354;&#12427;&#12290;
djb &#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#12383;&#12356;&#12390;&#12356;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#12399;&#21205;&#12363;&#12394;&#12356;&#12290;
&#12381;&#12428;&#12395;&#12399;&#12289;&#12383;&#12356;&#12390;&#12356;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12420;&#12426;&#26041;&#12364;&#38291;&#36949;&#12387;&#12390;&#12356;&#12427;&#12363;&#12425;&#12289;&#12392;&#12356;&#12358;&#12363;&#12435;&#12383;&#12435;&#12394;&#29702;&#30001;&#12364;&#12354;&#12427;&#12398;&#12384;&#12369;&#12428;&#12393;&#12290;
&#12375;&#12363;&#12375;&#12289;djb&#12395;&#23550;&#12377;&#12427;&#24974;&#24746;&#12399;&#12381;&#12428;&#20197;&#19978;&#12395;&#28145;&#12356;&#12290;
&#30906;&#35388;&#12364;&#12354;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12364;&#29575;&#30452;&#12395;&#35328;&#12358;&#12392;&#12289;&#36259;&#21619;&#12398;&#12424;&#12367;&#12394;&#12356;&#12402;&#12392;&#12403;&#12392;&#12364;&#12289;&#33258;&#20998;&#12383;&#12385;&#12398;&#29702;&#35299;&#12391;&#12365;&#12394;&#12356;&#12418;&#12398;&#12395;&#23550;&#12377;&#12427;&#36062;&#36059;&#12434;&#30446;&#12398;&#12354;&#12383;&#12426;&#12395;&#12375;&#12390;&#24594;&#12426;&#12289;&#19981;&#28288;&#12434;&#24863;&#12376;&#12390;&#12356;&#12427;&#12398;&#12391;&#12399;&#12394;&#12356;&#12363;&#12392;&#24605;&#12358;&#12290;
&#12377;&#12368;&#12428;&#12383;&#33464;&#34899;&#12392;&#12356;&#12358;&#12398;&#12399;&#12356;&#12388;&#12418;&#12289;&#35513;&#35607;&#20013;&#20663;&#12434;&#20276;&#12358;&#12418;&#12398;&#12394;&#12398;&#12384;&#12290;</p>

<p>&#12371;&#12371;&#12391;&#35328;&#12387;&#12390;&#12356;&#12427;&#12398;&#12399;&#12289; djb &#12398;&#20181;&#20107;&#12364;&#23436;&#29863;&#12384;&#12289;&#12392;&#12356;&#12358;&#12371;&#12392;&#12376;&#12419;&#12394;&#12356;&#12290;
&#12373;&#12387;&#12365;&#35328;&#12387;&#12383;&#12415;&#12383;&#12356;&#12395;&#12496;&#12464;&#12399;&#12354;&#12427;&#12375;&#12289;&#12525;&#12464;&#12501;&#12449;&#12452;&#12523;&#12399;&#20778;&#32654;&#12392;&#12399;&#35328;&#12356;&#38627;&#12356;&#12290;
&#12418;&#12375; djb &#12364;&#12356;&#12414;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#26360;&#12365;&#30452;&#12377;&#12392;&#12375;&#12383;&#12425;&#12289;&#33192;&#22823;&#12394;&#22793;&#26356;&#12364;&#12354;&#12427;&#12371;&#12392;&#12395;&#30097;&#12356;&#12399;&#12394;&#12356;&#12290;
&#12391;&#12418;&#12289;&#12376;&#12419;&#12354;&#12402;&#12392;&#12388;&#12420;&#12387;&#12390;&#12415;&#12424;&#12358;&#12363;&#12392;&#31435;&#12385;&#19978;&#12364;&#12387;&#12383;&#20154;&#12364;&#12356;&#12427;? &#12391;&#12365;&#12427;&#12363;&#12393;&#12358;&#12363;&#12373;&#12360;&#12289;&#35504;&#12418;&#12431;&#12363;&#12387;&#12390;&#12356;&#12394;&#12356;&#12435;&#12376;&#12419;&#12394;&#12356;?
djb &#12398;&#12467;&#12540;&#12489;&#12434;&#35501;&#12416;&#12414;&#12391;&#12289;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12362;&#12369;&#12427;&#12377;&#12368;&#12428;&#12383;&#33464;&#34899;&#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#12393;&#12358;&#12356;&#12358;&#12418;&#12398;&#12363;&#12289;&#31169;&#12395;&#12399;&#12431;&#12363;&#12425;&#12394;&#12363;&#12387;&#12383;&#12290;
&#12381;&#12375;&#12390;&#20170;&#12391;&#12399;&#12289;&#20182;&#12398;&#12393;&#12435;&#12394;&#12467;&#12540;&#12489;&#12434;&#35501;&#12435;&#12391;&#12418;&#12367;&#12377;&#12435;&#12391;&#12427;&#12424;&#12358;&#12395;&#24863;&#12376;&#12390;&#12375;&#12414;&#12358;&#12290;</p>

<p>&#12362;&#12414;&#12369;: &#12371;&#12371;&#12414;&#12391;&#35501;&#12435;&#12391;&#12365;&#12383;&#12394;&#12425;&#12289;<a href="http://www.aaronsw.com/weblog/001502">&#12356;&#12414; djb &#12364;&#12420;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;</a> &#12395;&#12418;&#33288;&#21619;&#12364;&#12431;&#12367;&#12435;&#12376;&#12419;&#12394;&#12356;&#12363;&#12394;&#12290;</p>

<hr>
<p>&#12458;&#12522;&#12472;&#12490;&#12523;: <a href="http://www.aaronsw.com/weblog/djb">djb</a> by Aaron Swartz&rsquo;s Raw Thought</p>





<script type="text/javascript"><!--
if (document.location.hash.substring(0, 2) != '#c') {
  document.write('<style type="text/css">#comments_body { display: none}</style>');
}
//--></script>

<script type="text/javascript"><!--
function showComments() {
  document.getElementById('comments_show').style.display='none';
  document.getElementById('comments_body').style.display='block';
  return false;
}
if (document.location.hash.substring(0, 2) != '#c') {
  document.write('<p id="comments_show"><a href="#comments" onclick="return showComments();">Read comments.</a></p>');
}
//--></script>
</div>