<div class="content">
<h1>C&oacute;mo contrato programadores</h1>
<div>December 30, 2009</div>
<a href="http://www.aaronsw.com/weblog/hiring.es">Original link</a><hr>

<p style="text-align: right"><a href="http://www.aaronsw.com/weblog/hiring.en">English</a></p>

<p><em>traducido por <a href="http://www.ipodizados.com/4558/contrato-programadores-aaron-swartz">iPodizados</a></em></p>

<p>Hay tres preguntas cuando est&aacute;s contratando a un programador (o a cualquier otro trabajador, para el caso): &iquest;Es inteligente? &iquest;Puede sacar el trabajo adelante? &iquest;Puedo trabajar con &eacute;l? Alguien que sea inteligente pero que no saca el trabajo adelante deber&iacute;a ser tu amigo, no tu empleado. Puedes hablar sobre tus problemas mientras procastinan (posponer conscientemente un trabajo que sabemos que tenemos que hacer) con su trabajo real. Alguien que saca adelante el trabajo pero que no es inteligente, es ineficiente: los que no son inteligentes sacan el trabajo adelante usando el camino m&aacute;s dif&iacute;cil y trabajar con ellos es lento y frustran. Por &uacute;ltimo, alguien con quien no puedes trabajar&hellip; bueno, pues no puedes trabajar con &eacute;l.</p>

<p>El proceso tradicional de contrataci&oacute;n de programadores consiste en: a) leer un curriculum, b) realizar algunas preguntas dif&iacute;ciles en una conversaci&oacute;n telef&oacute;nica, y c) darles un problema de programaci&oacute;n en persona. Creo que es un sistema horrible para contratar a alguien. Se puede aprender muy poco de un curriculum y la gente se pone nerviosa cuando les haces preguntas complejas en una entrevista. Programar no es el t&iacute;pico trabajo que se hace bajo presi&oacute;n, as&iacute; que ver c&oacute;mo se comporta alguien cuando est&aacute; nervioso es bastante in&uacute;til. Y las preguntas de la entrevista que normalmente se formulan parecen escogidas simplemente para que sean crueles. Creo que soy un programador bastante bueno, pero nunca he superado una de esas entrevistas y dudo que nunca lo pueda hacer.</p>

<p>As&iacute; que cuando tengo que contratar gente, intento responder a las tres preguntas [que planteaba al principio]. Para saber si pueden sacar el trabajo adelante, les pregunto qu&eacute; han hecho. Si de verdad hacen su trabajo, a estas alturas deber&iacute;an tener algo ya hecho. Es dif&iacute;cil ser buen programador sin alg&uacute;n tipo de experiencia previa y en estos d&iacute;as todo el mundo puede obtener experiencia colaborando en alg&uacute;n proyecto de software libre. As&iacute; que les pido una muestra del c&oacute;digo y una demostraci&oacute;n y miro a ver si me gusta. Aprendes un mont&oacute;n r&aacute;pidamente, porque no les est&aacute;s mirando mientras responden a una compleja pregunta de entrevista, sino que est&aacute;s viendo el c&oacute;digo real que han producido. &iquest;Es conciso? &iquest;Claro? &iquest;Elegante? &iquest;Usable? &iquest;Es algo que querr&iacute;as en tu producto?</p>

<p>Para saber si alguien es inteligente, tengo una conversaci&oacute;n informal con ellos. Hago todo lo posible por eliminar la presi&oacute;n: me encuentro con la persona en un caf&eacute;, les digo claramente que no es una entrevista, hago todo lo que puedo por ser informal y amigable. Bajo ning&uacute;n pretexto les hago &ldquo;preguntas est&aacute;ndar&rdquo; de entrevista. Simplemente hablo con ellos como lo har&iacute;a con alguien que conozco en una fiesta. (Si le pides a la gente que conoces en una fiesta que enumeren sus puntos fuertes y d&eacute;biles o que estimen el n&uacute;mero de afinadores de piano que hay en Madrid, tienes problemas m&aacute;s importantes). Creo que es bastante sencillo saber si alguien es inteligente mientras sostienes una conversaci&oacute;n informal con &eacute;l. Constantemente hago juicios sobre si la gente que estoy conociendo es inteligente, de la misma forma que constantemente estoy evaluando si la gente que veo me parece atractiva.</p>

<p>Pero si tuviera que escribir qu&eacute; es lo que hace que alguien me parezca inteligente, pondr&iacute;a el &eacute;nfasis en tres cosas. La primera &iquest;tienen conocimientos? Preg&uacute;ntales en qu&eacute; han estado pensado y comprueba su nivel de conocimiento sobre ello. &iquest;Parecen comprenderlo al detalle? &iquest;Pueden explicarlo claramente? (explicaciones claras son un signo de que realmente conocen la materia). &iquest;Saben cosas sobre ese tema que t&uacute; no sabes?</p>

<p>Segunda, &iquest;son curiosos? &iquest;Responden haci&eacute;ndote preguntas sobre ti? &iquest;Est&aacute;n genuinamente interesados o simplemente est&aacute;n siendo educados? &iquest;Realizan preguntas sobre lo que est&aacute;s diciendo? &iquest;Te hacen pensar sus preguntas?</p>

<p>Tercero, &iquest;Aprenden? En alg&uacute;n punto de la conversaci&oacute;n, probablemente acabar&aacute;s explic&aacute;ndole algo. &iquest;Lo entienden de verdad o simplemente asienten y sonr&iacute;en? Hay gente que sabe cosas sobre alguna peque&ntilde;a &aacute;rea, pero no tienen curiosidad con respecto a otras. Y hay gente que es curiosa pero no aprende, realizan muchas preguntas pero en realidad no est&aacute;n escuchando. Y yo quiero alguien que cumpla las tres cosas [escuchar+preguntar+aprender].</p>

<p>Finalmente, concluyo si puedo trabajar con alguien pasando alg&uacute;n tiempo con esa persona. Mucha gente brillante puede parecer agradable en una conversaci&oacute;n de una hora, pero sus excentricidades se hacen patentes despu&eacute;s de un par de horas. As&iacute; que, una vez que hayas acabado la charla, inv&iacute;tale a comer con el resto del equipo o a jugar a algo en la oficina. Por supuesto, mantengo las cosas tan informales como sea posible. El objetivo es, precisamente, ver si te ponen de los nervios.</p>

<p>Si todo parece correcto y ya me siento preparado para contratar a alguien, hago una peque&ntilde;a comprobaci&oacute;n final de seguridad para confirmar que no me la han dado con queso: les pido que hagan una parte del trabajo. Normalmente, esto supone escoger una parte del proyecto suficientemente independiente y pedir que la escriban (si realmente necesitas ver a alguien trabajando bajo presi&oacute;n, ponles una fecha de entrega). Si es necesario, puedes ofrecer pagarles por el trabajo, pero a la mayor&iacute;a de los programadores que me he encontrado no les importa que les encargues una tarea peque&ntilde;a como esta siempre y cuando puedan publicar el c&oacute;digo de su trabajo cuando est&eacute; acabado. Esta prueba no funciona por ella misma, pero si alguien ha pasado las primeras tres partes, deber&iacute;a ser suficiente para probar que no te han enga&ntilde;ado, y que realmente pueden sacar adelante el trabajo.</p>

<p>(He conocido gente que me dice &ldquo;Perfecto, &iquest;por qu&eacute; no probamos a contratarte un mes y vemos c&oacute;mo sale? Esto no parece funcionar. Si no puedes hacerte una idea despu&eacute;s de encargarle un peque&ntilde;o trabajo, tambi&eacute;n podr&iacute;a pasarte que un mes despu&eacute;s tampoco tuvieras una opini&oacute;n clara y has acabado contratando gente que no son suficientemente buenos. Mejor decir directamente no y equivocarse por el lado de intentar conseguir a los m&aacute;s indicados [que acabar con alguien que no da la talla].</p>

<p>Estoy bastante contento con este m&eacute;todo. Cuando me he saltado algunas partes, he acabado con contrataciones fallidas que finalmente he tenido que deshacer. Pero cuando las he seguido, he conseguido gente que me gusta tanto que me siento mal si tengo que dejar de trabajar con ellos.</p>

<p>Me sorprende que en vez de esta perspectiva, haya tantas empresas que utilicen unas t&eacute;cnicas tan est&uacute;pidas para contratar.</p>





<script type="text/javascript"><!--
if (document.location.hash.substring(0, 2) != '#c') {
  document.write('<style type="text/css">#comments_body { display: none}</style>');
}
//--></script>

<script type="text/javascript"><!--
function showComments() {
  document.getElementById('comments_show').style.display='none';
  document.getElementById('comments_body').style.display='block';
  return false;
}
if (document.location.hash.substring(0, 2) != '#c') {
  document.write('<p id="comments_show"><a href="#comments" onclick="return showComments();">Read comments.</a></p>');
}
//--></script>
</div>